Revit 2027 API
ConceptualConstructionType.IsValidSubcategoryForMassSurfaceDatas Method
 Validate if a subcategory is appropriate for assignment to Massing surfaces (MassSurfaceData). This is the list of acceptable values:
OST_MassInteriorWall
OST_MassExteriorWall
OST_MassExteriorWallUnderground
OST_MassRoof
OST_MassFloor
OST_MassSlab
OST_MassShade
OST_MassGlazing
OST_MassSkylights
OST_MassOpening
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidSubcategoryForMassSurfaceDatas(
	ElementId massSubCategoryId
)
Public Shared Function IsValidSubcategoryForMassSurfaceDatas (
	massSubCategoryId As ElementId
) As Boolean
public:
static bool IsValidSubcategoryForMassSurfaceDatas(
	ElementId^ massSubCategoryId
)
static member IsValidSubcategoryForMassSurfaceDatas :
        massSubCategoryId : ElementId -> bool
Parameters
massSubCategoryId ElementId
 The mass sub-category to be checked.
Return Value
Boolean
 True if the mass sub-category falls within the list, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This excludes sub-categories which are not actually sub-categories that can be assigned to surfaces, such as OST_MassWallsAll for example.
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace